# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [232]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

### Merge the DataFrames

In [233]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

## Deliverable 1: Get a Summary DataFrame

In [234]:
#  1. Get the total rides for each city type
total_rides = pyber_data_df.groupby(["type"]).count()["ride_id"]
total_rides

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [235]:
# 2. Get the total drivers for each city type
total_drivers = city_data_df.groupby(["type"]).sum()["driver_count"]
total_drivers

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [236]:
#  3. Get the total amount of fares for each city type
total_fares = pyber_data_df.groupby(["type"]).sum()["fare"]
total_fares

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [237]:
#  4. Get the average fare per ride for each city type. 
avg_fare_per_ride = total_fares/total_rides
avg_fare_per_ride

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
dtype: float64

In [238]:
# 5. Get the average fare per driver for each city type. 
avg_fare_per_driver = total_fares / total_drivers
avg_fare_per_driver

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

In [239]:
#  6. Create a PyBer summary DataFrame. 
data = [total_rides, total_drivers, total_fares,avg_fare_per_ride,avg_fare_per_driver]
pyber_summary_df = pd.DataFrame(data).transpose()
pyber_summary_df = pyber_summary_df.rename(columns={'ride_id': 'Total Rides', 'driver_count': 'Total Drivers','fare':'Total Fares','Unnamed 0':'Average Fare per Ride','Unnamed 1':'Average Fare per Driver'})

In [240]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None

In [241]:
#  8. Format the columns.
pyber_summary_df['Total Rides'] = pyber_summary_df['Total Rides'].map("{:,.0f}".format)
pyber_summary_df['Total Drivers'] = pyber_summary_df['Total Drivers'].map("{:,.0f}".format)
pyber_summary_df['Total Fares'] = pyber_summary_df['Total Fares'].map("${:,.2f}".format)
pyber_summary_df['Average Fare per Ride'] = pyber_summary_df['Average Fare per Ride'].map("${:,.2f}".format)
pyber_summary_df['Average Fare per Driver'] = pyber_summary_df['Average Fare per Driver'].map("${:,.2f}".format)
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,"1,625","2,405","$39,854.38",$24.53,$16.57

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [242]:
# 1. Read the merged DataFrame
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

In [243]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.
daily_fare_df = pyber_data_df.groupby(["type", "date"]).sum()[["fare"]]

In [244]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
daily_fare_df = daily_fare_df.reset_index()

In [249]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date. 
daily_fare_df.pivot(index=['date'], columns=['type'], values=['fare'])

                     fare
type                Rural Suburban  Urban
date
2019-01-01 00:08:16   NaN      NaN  37.91
2019-01-01 00:46:46   NaN    47.74    NaN
2019-01-01 02:07:24   NaN    24.07    NaN
2019-01-01 03:46:50   NaN      NaN   7.57
2019-01-01 05:23:21   NaN      NaN  10.75
...                   ...      ...    ...
2019-05-08 04:20:00   NaN      NaN  21.99
2019-05-08 04:39:49   NaN      NaN  18.45
2019-05-08 07:29:01   NaN      NaN  18.55
2019-05-08 11:38:35   NaN      NaN  19.77
2019-05-08 13:10:18   NaN      NaN  18.04

[2375 rows x 3 columns]

In [250]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.
jan_apr_fare_df = daily_fare_df.loc[(daily_fare_df['date']> '2019-01-01') & (daily_fare_df['date'] < '2019-04-29')]
jan_apr_fare_df

       type                 date   fare
0     Rural  2019-01-01 09:45:36  43.69
1     Rural  2019-01-02 11:18:32  52.12
2     Rural  2019-01-03 19:51:01  19.90
3     Rural  2019-01-04 03:31:26  24.88
4     Rural  2019-01-06 07:38:40  47.33
...     ...                  ...    ...
2254  Urban  2019-04-28 10:54:14  10.07
2255  Urban  2019-04-28 12:48:34  33.35
2256  Urban  2019-04-28 14:28:36  11.46
2257  Urban  2019-04-28 16:29:16  36.42
2258  Urban  2019-04-28 17:26:52  31.43

[2196 rows x 3 columns]

In [251]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
jan_apr_fare_df=jan_apr_fare_df.set_index('date')
jan_apr_fare_df.index = pd.to_datetime(jan_apr_fare_df.index)
jan_apr_fare_df

                      type   fare
date
2019-01-01 09:45:36  Rural  43.69
2019-01-02 11:18:32  Rural  52.12
2019-01-03 19:51:01  Rural  19.90
2019-01-04 03:31:26  Rural  24.88
2019-01-06 07:38:40  Rural  47.33
...                    ...    ...
2019-04-28 10:54:14  Urban  10.07
2019-04-28 12:48:34  Urban  33.35
2019-04-28 14:28:36  Urban  11.46
2019-04-28 16:29:16  Urban  36.42
2019-04-28 17:26:52  Urban  31.43

[2196 rows x 2 columns]

In [252]:
# 7. Check that the datatype for the index is datetime using df.info()
jan_apr_fare_df.info()
jan_apr_fare_df

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2196 entries, 2019-01-01 09:45:36 to 2019-04-28 17:26:52
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   type    2196 non-null   object
 1   fare    2196 non-null   float64
dtypes: float64(1), object(1)
memory usage: 51.5+ KB

                      type   fare
date
2019-01-01 09:45:36  Rural  43.69
2019-01-02 11:18:32  Rural  52.12
2019-01-03 19:51:01  Rural  19.90
2019-01-04 03:31:26  Rural  24.88
2019-01-06 07:38:40  Rural  47.33
...                    ...    ...
2019-04-28 10:54:14  Urban  10.07
2019-04-28 12:48:34  Urban  33.35
2019-04-28 14:28:36  Urban  11.46
2019-04-28 16:29:16  Urban  36.42
2019-04-28 17:26:52  Urban  31.43

[2196 rows x 2 columns]

In [263]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.
weekly_fare_df = jan_apr_fare_df.resample('W').sum()
weekly_fare_df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 17 entries, 2019-01-06 to 2019-04-28
Freq: W-SUN
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   fare    17 non-null     float64
dtypes: float64(1)
memory usage: 272.0 bytes

In [ ]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')